// images
import marketing from "@/assets/images/strategy/strategy-6.png";
import BrainImage from "@/assets/images/strategy/strategy-x2.png";
import ArrowBusinessPlan from "@/assets/images/strategy/strategy2-10.png";
import questionImage from "@/assets/images/strategy/strategy2-12.png";
import businessPalnImg from "@/assets/images/strategy/strategy2-2.png";
import winnerPlaceHolder from "@/assets/images/strategy/strategy2-3.png";
import handChess from "@/assets/images/strategy/strategy2-5.png";
import sharpImage from "@/assets/images/strategy/strategy2-7.png";
import contentStrategy from "@/assets/images/strategy/strategy2-8.png";
import research from "@/assets/images/strategy/strategy2-9.png";
import Image from "next/image";
const Strategy = () => {
  return (
    // strategy
    <div className="container">
      <div className="w-full h-[133px] md:h-[500px] bg-no-repeat bg-tadvin-strategy bg-center bg-contain bg- relative"></div>
      <p className="textStyle px-4 my-12 md:-mt-32 relative z-50">
        آیا از حداکثر ظرفیت برند خود استفاده می‌کنید؟ ما با رویکردی منحصربه‌فرد،
        استراتژی را برای برند شما برنامه‌ریزی می‌کنیم که نتایج آن کسب وکارتان را
        متحول خواهد کرد. ما روی نحوه تعامل مخاطبان با برند تمرکز می‌کنیم و
        راه‌حل‌های خلاقانه‌ای را برای تعامل ارزشمند با بازار هدف ارائه می‌دهیم.
        سبز افرنگ فیلم در طول فعالیت خود استراتژی‌های خلاقانه‌ای را برای برندهای
        مختلف طراحی کرده و توانایی ارائه راه‌حل‌های هدفمند متناسب با برند را
        دارد.
      </p>
      {/* business */}
      <div className="w-full ">
        <Image
          src={businessPalnImg}
          className="w-full  md:w-4/5 mx-auto "
          alt="businessPalnImg"
        />
        <div className=" flex flex-col items-center justify-evenly lg:block mt-12 relative">
          {/* lg:rotate-0 lg:bottom-20 lg:right-28 bottom-[80%] right-[50%] sm:right-[75%] */}

          <h2 className="text-primaryGreen text-2xl w-4/5 lg:text-3xl font-bold transition-all duration-500 rota lg:absolute block static lg:top-12 lg:right-8 text-right">
            تحقیقات برند
          </h2>
          <p className="textStyle px-4 my-12 md:w-3/5 relative z-50 ">
            <Image
              src={ArrowBusinessPlan}
              className="w-40 lg:w-52 mx-auto absolute -rotate-45 left-10 -top-28 lg:rotate-0 lg:-top-16 lg:-right-full"
              alt="businessPalnImg"
            />
            آیا از حداکثر ظرفیت برند خود استفاده می‌کنید؟ ما با رویکردی
            منحصربه‌فرد، استراتژی را برای برند شما برنامه‌ریزی می‌کنیم که نتایج
            آن کسب وکارتان را متحول خواهد کرد. ما روی نحوه تعامل مخاطبان با برند
            تمرکز می‌کنیم و راه‌حل‌های خلاقانه‌ای را برای تعامل ارزشمند با بازار
            هدف ارائه می‌دهیم. سبز افرنگ فیلم در طول فعالیت خود استراتژی‌های
            خلاقانه‌ای را برای برندهای مختلف طراحی کرده و توانایی ارائه
            راه‌حل‌های هدفمند متناسب با برند را دارد.
          </p>
        </div>
      </div>
      {/* brain */}
      <div className="w-full ">
        <Image src={BrainImage} alt="brain" className="w-4/5 block mx-auto" />
        <div className="md:-mt-56 px-4">
          <Image
            src={winnerPlaceHolder}
            alt="brain"
            className="w-2/6 md:w-1/5 md:mr-16"
          />
          <p className="textStyle  my-12  relative z-50 ">
            جایگاه‌یابی برند فرآیندی است که برند شما را در ذهن مشتریان قرار
            می‌دهد. جایگاه‌یابی فراتر از طراحی یک شعار و لوگو است و نقش مهمی در
            متمایز کردن کسب‌وکار شما از رقبا دارد. شما زمانی جایگاه موثری در ذهن
            مخاطب دارید که آنها برندتان را مطلوب، ارزشمند و معتبر بدانند و برای
            خرید، سریعا شما را در ذهن به یاد آورند. به طور خلاصه جایگاه برند
            تصویری منحصربه‌فرد از کسب و کار شما می‌سازد که برند شما را در ذهن
            مشتری حک می‌کند.
          </p>
        </div>
      </div>
      {/* hand chess */}
      <div className="w-full">
        <Image src={handChess} alt="chess" className="w-4/5 block mx-auto" />

        <div className="w-4/5 mx-auto -mt-12">
          <Image src={questionImage} alt="chess" className="w-32 block" />
        </div>
        <div className="px-4">
          <h2 className="text-primaryGreen textStyle mt-6 text-2xl w-4/5 lg:text-2xl font-bold">
            استراتژی بازاریابی
          </h2>
          <p className="textStyle md:w-4/5 mt-5">
            برندهای مختلف برای پیشبرد اهداف شرکت به صورت سازمان‌یافته، به یک
            استراتژی تبلیغاتی مناسب نیاز دارند تا فعالیت‌های بازاریابی را مطابق
            آن اجرا کنند. استراتژی بازاریابی مجموع تلاش‌هایی است که برند برای
            ایجاد آگاهی و افزایش فروش برنامه‌ریزی می‌کند و شامل معرفی محصولات
            جدید، تعیین نرخ تبدیل در فروش، افزایش دنبال‌کنندگان در شبکه‌های
            اجتماعی، دسترسی به بازار هدف و جذب مشتریان فعلی و .. است.
          </p>
          <p className="textStyle md:w-4/5 mt-5">
            استارت‌آپ‌ها، کسب‌وکارهای کوچک و شرکت‌های بزرگ با استفاده از ترکیبی
            از کانال‌های بازاریابی سنتی و کانال‌های بازاریابی دیجیتال، کمپین‌های
            تبلیغاتی استراتژیک ایجاد می‌کنند. تبلیغات سنتی شامل تبلیغات
            تلویزیونی، تبلیغات چاپی و بیلبوردها است. تاکتیک‌های تبلیغات دیجیتال
            شامل بازاریابی محتوای مبتنی بر SEO، رسانه‌های اجتماعی و کمپین‌های
            بازاریابی ایمیلی است.
          </p>
          <p className="textStyle md:w-4/5 mt-5">
            یک استراتژی تبلیغاتی درست، نقش هر یک از اعضای تیم برای دستیابی به
            اهداف شرکت (ارتباط با مخاطب هدف، جذب مشتریان جدید یا رسیدن به
            کانال‌های فروش جدید) را تعیین می‌کند. وظیفه اصلی اجرای این برنامه به
            عهده بخش بازاریابی است، اما از تیم محصول گرفته تا کارکنان پشتیبانی
            می‌توانند در رسیدن به اهداف و افزایش سود شرکت نقش داشته باشند. موسسه
            سبز افرنگ فیلم با شناخت دقیق همه‌جانبه نیازها و فرصت‌های برند به شما
            کمک می‌کند تا با تدوین استراتژی بهینه، هر چه بیشتر به اهداف خود
            نزدیک شوید.
          </p>
        </div>
      </div>
      {/* marketing */}
      <div className="w-full">
        <Image
          src={marketing}
          alt="chess"
          className="w-full md:w-5/6  mx-auto  block"
        />
        <p className="textStyle w-4/5 mt-12">
          در دنیای پرشتاب و پررقابت امروزی، رسانه چیزی فراتر از یک عنصر مهم است.
          کسب‌وکارها برای دستیابی به مخاطبان هدف، آگاهی از برند، افزایش تقاضای
          محصول و در نهایت فروش، به رسانه‌هایی اثرگذار نیاز دارند. برندها باید
          با تدوین یک استراتژی مناسب رسانه و تولید محتوا به شکلی خلاقانه با
          مشتریان بالقوه ارتباط برقرار کنند تا به اهداف بازاریابی خود برسند.
          دنیای رسانه‌های مدرن لایه‌ها و بخش‌های مختلفی دارد و درک کامل عناصر
          کلیدی آنها برای برنامه‌ریزی استراتژی رسانه‌ای ضروری است. از طرفی هیچ
          دو کسب‌وکاری شبیه هم نیستند، بنابراین استرتژی رسانه هر برندی متفاوت
          است و به اهداف، نیازها و مخاطبان آنها بستگی دارد. موسسه سبز افرنگ با
          چندین سال تجربه در حوزه استراتژی رسانه، به برندها در صنایع متنوع کمک
          کرده تا راه منحصربه‌فرد خود را برای دستیابی به بازار هدف شناسایی کنند.
        </p>
      </div>
      {/* content strategy */}
      <div className="w-full">
        <Image src={sharpImage} alt="chess" className="w-5/6 mx-auto  block" />

        <p className="textStyle w-4/5 mt-5">
          تولید محتوای جذاب، مشتریان جدید را به کسب‌وکار شما سرازیر می‌کند و سبب
          ارتقای برند و افزایش فروش می‌شود. اما در فضای شلوغ دیجیتال، محتواها
          شانس کمی برای دیده شدن به‌وسیله مخاطبان هدف دارند و به همین دلیل
          موفقیت یک محتوا به طور مستقیم به یک استراتژی محتوای اثرگذار مرتبط است.
          ما در موسسه سبز افرنگ فیلم محتوایی را طراحی می‌کنیم که دقیقا برای
          مخاطبان هدف شما برنامه‌ریزی شده است. خدمات بازاریابی محتوایی ما با
          استراتژی‌ها و طراحی‌های منحصربه‌فرد شروع می‌شود تا محتوایی کارآمد برای
          برند شما تولید شود. حتی بهترین محتواها هم بدون برنامه‌ریزی ضعیف عمل
          می‌کنند. تیم خلاقیت سبز افرنگ فیلم با یک فرایند برنامه‌ریزی صحیح به
          برند شما کمک می‌کند تا قدم‌های محکمی در این راستا بردارید.
        </p>
      </div>

      {/* sharp */}
      <div className="w-full">
        <Image
          src={contentStrategy}
          alt="chess"
          className="w-5/6 mx-auto  block"
        />

        <p className="textStyle w-4/5 mt-5">
          تولید محتوای جذاب، مشتریان جدید را به کسب‌وکار شما سرازیر می‌کند و سبب
          ارتقای برند و افزایش فروش می‌شود. اما در فضای شلوغ دیجیتال، محتواها
          شانس کمی برای دیده شدن به‌وسیله مخاطبان هدف دارند و به همین دلیل
          موفقیت یک محتوا به طور مستقیم به یک استراتژی محتوای اثرگذار مرتبط است.
          ما در موسسه سبز افرنگ فیلم محتوایی را طراحی می‌کنیم که دقیقا برای
          مخاطبان هدف شما برنامه‌ریزی شده است. خدمات بازاریابی محتوایی ما با
          استراتژی‌ها و طراحی‌های منحصربه‌فرد شروع می‌شود تا محتوایی کارآمد برای
          برند شما تولید شود. حتی بهترین محتواها هم بدون برنامه‌ریزی ضعیف عمل
          می‌کنند. تیم خلاقیت سبز افرنگ فیلم با یک فرایند برنامه‌ریزی صحیح به
          برند شما کمک می‌کند تا قدم‌های محکمی در این راستا بردارید.
        </p>
      </div>
      {/* research */}
      <div className="w-full mb-8">
        <Image src={research} alt="chess" className="w-5/6 mx-auto  block" />
        <h2 className="text-primaryGreen textStyle mt-6 text-2xl w-4/5 lg:text-2xl font-bold">
          داستان‌سرایی و تدوین پیام اصلی برند
        </h2>
        <p className="textStyle w-4/5 mt-5">
          تولید محتوای جذاب، مشتریان جدید را به کسب‌وکار شما سرازیر می‌کند و سبب
          ارتقای برند و افزایش فروش می‌شود. اما در فضای شلوغ دیجیتال، محتواها
          شانس کمی برای دیده شدن به‌وسیله مخاطبان هدف دارند و به همین دلیل
          موفقیت یک محتوا به طور مستقیم به یک استراتژی محتوای اثرگذار مرتبط است.
          ما در موسسه سبز افرنگ فیلم محتوایی را طراحی می‌کنیم که دقیقا برای
          مخاطبان هدف شما برنامه‌ریزی شده است. خدمات بازاریابی محتوایی ما با
          استراتژی‌ها و طراحی‌های منحصربه‌فرد شروع می‌شود تا محتوایی کارآمد برای
          برند شما تولید شود. حتی بهترین محتواها هم بدون برنامه‌ریزی ضعیف عمل
          می‌کنند. تیم خلاقیت سبز افرنگ فیلم با یک فرایند برنامه‌ریزی صحیح به
          برند شما کمک می‌کند تا قدم‌های محکمی در این راستا بردارید.
        </p>
      </div>
    </div>
  );
};

export default Strategy;
