// images
import boatImage from "@/assets/images/animation/creative2-2-2048x1286.png";
import copyRight from "@/assets/images/animation/creative2-3-2048x1490.png";
import penHand from "@/assets/images/animation/creative2-4.png";
import three from "@/assets/images/animation/creative2-5.png";
import creativity from "@/assets/images/animation/creativity06.png";
import GreenButton from "@/ui/button/greenButton";
import Image from "next/image";

const Animation = () => {
  return (
    <div className="container">
      <Image src={creativity} alt="creativvity" />
      <div className="px-4">
        <h2 className="text-primaryGreen textStyle mt-6 text-2xl w-4/5 lg:text-2xl font-bold">
          محتوای خلاق، تجربه‌ای جذاب
        </h2>
        <p className="textStyle md:w-4/5 mt-5">
          برند شما فراتر از آن چیزی است که به نظر می‌رسد. اگر می‌خواهید خود را
          در یک صنعت متمایز کنید و به یک لیدر تبدیل شوید باید خلاقیت به خرج
          دهید! یک تجربه یونیک از محصول و خدمات برای کاربر فراهم کنید تا نتواند
          شما را فراموش کند. در دو دهه گذشته، ما محتواهایی مانند انیمیشن‌های
          سه‌بعدی، موشن‌گرافیک، ویدیو‌های رئال و … را برای طیف وسیطی از مشتریان
          در صنایع مختلف طراحی و تولید کرده‌ایم. این متواها با تکیه بر نیازسنجی
          عمیق مشتریان ساخته شده و توانسته ارتباط بین برند و مخاطب را در سطح
          بالایی گسترش و بهبود دهد. سبز افرنگ فیلم با تولید محتوای داستان‌محور و
          موثر به شناخت برند و اعتبار آن بین مخاطبان کمک کرده و سبب تمایز برند
          شما بین رقبا خواهد شد.
        </p>
      </div>

      {/* ideas */}
      <div className="w-full md:w-4/5 mx-auto">
        <Image src={boatImage} alt="boat" />
      </div>
      <div className="px-4">
        <h2 className="text-primaryGreen textStyle mt-6 text-2xl w-4/5 lg:text-2xl font-bold">
          طراحی خلاقانه و بصری
        </h2>
        <p className="textStyle md:w-4/5 mt-5">
          برندها برای تاثیرگذاری روی مخاطبان، کمتر از یک ثانیه فرصت دارند. به
          همین دلیل برای متمایز شدن از رقبا، نیاز به تفکر خلاق و منحصربه‌فرد و
          مهارت‌های طراحی یونیک دارید. وقتی صحبت از یک طراحی گرافیکی خاص و
          کارگردانی هنری موثر می‌شود، ما سابقه چشمگیری داریم و می‌توانیم با
          طراحی خلاقانه و یونیک تاثیر اولیه ویژه‌ای روی مخاطبان بگذاریم. موسسه
          سبز افرنگ فیلم تا کنون به صدها برند در صنایع مختلف از محصولات بهداشتی
          تا خدمات بانکی و بیمه کمک کرده تا با طراحی پوسترها و گرافیک‌های جذاب و
          غیرمنتظره، مخاطبان خود را در رده‌‌های سنی و اجتماعی مختلف تحت تاثیر
          قرار دهند.
        </p>
        <p className="textStyle md:w-4/5 mt-5">
          تمامی دارایی‌های برند یک طرف، طراحی یک طرف! طراحی گرافیکی همان چیزی
          است که تصویر برند را در کانال‌های مختلف رسانه‌ای دیجیتال و سنتی و
          شبکه‌های اجتماعی به نمایش می‌گذارد و معمولا اولین چیزی است که مخاطب از
          شما می‌بیند.
        </p>
        <p className="textStyle md:w-4/5 mt-5">
          ما به شما کمک می‌کنیم تا به برند جان بدهید و شخصیت آن را بسازید. این
          کاری است که اتاق فکر و تیم خلاق موسسه، با دانش تخصصی، مهارت و تجربه
          انجام می‌دهند.
        </p>
      </div>
      {/* copy right */}
      <div className=" my-12">
        <div className="w-full md:w-4/5 mx-auto">
          <Image src={copyRight} alt="boat" />
        </div>
        <p className="textStyle md:w-4/5 mt-5">
          اولویت سبز افرنگ فیلم به‌عنوان یک آژانس خلاق در حوزه تولید محتوا و
          کپی‌رایتینگ، تعامل سازنده با مخاطب و افزایش فروش است. ما مبانی سئو را
          در تولید محتوا به خوبی می‌شناسیم و به بهترین شکل نیازهای متنوع مشتریان
          را برآورده می‌کنیم. شما می‌توانید با یک کپی ماندگار، در میان دیگر
          برندها متمایز شوید و تصویر جدیدی در ذهن مخاطب بسازید. ما با
          کپی‌رایتینگ خلاقانه، کاری می کنیم بیشتر و بهتر دیده شوید. فرقی نمی‌کند
          به‌دنبال نوشتن توصیف یک محصول برای فروش هستید یا یک شعار تبلیغاتی
          می‌خواهید، ما این توانایی و تخصص را داریم تا نسخه‌ای عالی از درخواست
          شما ارئه دهیم.
        </p>
      </div>
      {/* three person */}
      <div className=" my-12">
        <div className="w-full md:w-4/5 mx-auto">
          <Image src={three} alt="boat" />
        </div>
        <p className="textStyle md:w-4/5 mt-5">
          با کپی رایتینگ می‌توانید استاندارد تمامی نوشتارهای مرتبط با کسب و کار
          را بهبود دهید. چرا که وبسایت یا نوشتارهای شبکه‌های اجتماعی اولین نقطه
          تعامل شما با مشتری است و باید به‌درستی انجام شود.
        </p>
        <p className="textStyle md:w-4/5 mt-5">
          خدمات کپی رایتینگ سبز افرنگ فیلم در راستای اهداف شما و مشتریان احتمالی
          شما طراحی شده است. به همین دلیل برند مستقیما مخاطب هدف را جذب می‌کند.
          خدمات کپی‌رایتینگ ما بسیار گسترده است و شامل تمامی تولید محتواهای
          مربوط به اخبار، شعار برند، محتوای وبلاگ، محتوای تجربه کاربری (UX
          Writing) و … می‌شود.
        </p>
      </div>

      <div className="w-full md:w-4/5 mx-auto">
        <Image src={penHand} alt="pen" />
      </div>

      <GreenButton title="مشاهده نمونه کارها" path="/" />
    </div>
  );
};

export default Animation;
